/**
 * 버블 정렬
 * 옆에 있는 값과 비교하여 더 작은 값의 순서를 앞으로 이동시킨다.
 * 정렬 중 가장 효율이 나쁨
 */

function sortBubble(arr) {
    let tmp;

    // N1
    for (i = 0; i < arr.length; i++) {
        // N2
        for (j = 0; j < arr.length - i; j++) {
            if (arr[j] > arr[j + 1]) {
                tmp = arr[j];
                arr[j] = arr[j + 1];
                arr[j + 1] = tmp;
            }
        }
    }
}

/** i 루프 1회
 * [1, 10, 5, 8, 7, 6, 4, 3, 2, 9] j(0) vs j(1) = 1 vs 10
 * [1, 10, 5, 8, 7, 6, 4, 3, 2, 9] j(1) vs j(2) = 10 vs 5 -> 스위칭
 * [1, 5, 10, 8, 7, 6, 4, 3, 2, 9] j(2) vs j(3) = 10 vs 8 -> 스위칭
 * [1, 5, 8, 10, 7, 6, 4, 3, 2, 9] j(3) vs j(4) = 10 vs 7 -> 스위칭
 * [1, 5, 8, 7, 10, 6, 4, 3, 2, 9] j(4) vs j(5) = 10 vs 6 -> 스위칭
 * [1, 5, 8, 7, 6, 10, 4, 3, 2, 9] j(5) vs j(6) = 10 vs 4 -> 스위칭
 * [1, 5, 8, 7, 6, 4, 10, 3, 2, 9] j(6) vs j(7) = 10 vs 3 -> 스위칭
 * [1, 5, 8, 7, 6, 4, 3, 10, 2, 9] j(7) vs j(8) = 10 vs 2 -> 스위칭
 * [1, 5, 8, 7, 6, 4, 3, 2, 10, 9] j(8) vs j(9) = 10 vs 9 -> 스위칭
 * [1, 5, 8, 7, 6, 4, 3, 2, 9, 10] i가 0일 때의 루프 끝
 */

const arr = [1, 10, 5, 8, 7, 6, 4, 3, 2, 9];

sortBubble(arr);
console.log(arr);
